# CurveDriverError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..CurveDriverError Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Element's internal join data is corrupt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurveDriverError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveDriverError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurveDriverError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace